JimBoHa/esp32-p4-bacnet-switches/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# This Waveshare board uses the ESP32-P4 revision 0.x/1.x silicon family.
# ESP-IDF 5.5+ requires selecting it explicitly because it is not binary
# compatible with revision 3.x silicon.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Waveshare ESP32-P4-POE-ETH baseline used by its official examples.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# ESP32-P4 internal EMAC connected to the board's IP101GRI PHY.
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_USE_SPI_ETHERNET=n

# Dual-slot authenticated HTTPS OTA with automatic rollback.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_OTA_HTTPS_ENABLED=y
CONFIG_OTA_HTTPS_PORT=443
CONFIG_OTA_BEARER_TOKEN="8f3e26ea94e00e675f2c6e9c73d0433e0cf2198d267d04cf6e828efd0c6750d4"
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# BACnet/IP owns one UDP socket and needs directed-broadcast transmission.
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_REUSE=y
